*Part 2: Python for Data Analysis III*
### Data Wrangling with Pandas
#Exercises#



---


<font color='violet'>
Hints are written in white, so you do not see them immediately. If you highlight them (or double-click on them), they will appear! 
<font color='white'> I am a hint! :-)


---

For this exercise, we will use the following datasets: 
* ``homicide.csv`` (homicide and other data for all countries)
* ``real-gdp-per-capita.csv`` (country level gdp data from 1950-2017)
* ``life_satsifaction_clean.csv`` (homicide and other data for all countries)

You can find them here: https://drive.google.com/drive/folders/1QnHTDQ0tb8_Ex6dMgNCwqJuL3PxzEKIv 

Copy them to your drive or to a folder on your computer. Import ``pandas``, ``numpy`` and ``os`` and change your directory to the folder where you placed your data. If you work with Google Drive, mount your drive!

In [59]:
import pandas as pd
import numpy as np
import os

In [60]:
os.chdir("../4_Data")

If you do not manage to mount your drive, you can also read the data using `pd.read_csv()` from the following URLs:

* `"http://farys.org/daten/homicide.csv"`
* `"http://farys.org/daten/real-gdp-per-capita.csv"`
* `"http://farys.org/daten/life_satisfaction_clean.csv"`

## Exercise 1

Consider the following two datasets:

In [61]:
income1 = pd.DataFrame({"income": [4300, 8600, 5200], 
                        "sex": ["m", "m", "f"]},
                       index=["Max", "Peter", "Mary" ])
income1

       income sex
Max      4300   m
Peter    8600   m
Mary     5200   f

In [62]:
income2 = pd.DataFrame({"income": [2300, 9600], "sex": ["f", "f"]},
                       index=["Annina", "Petra"])
income2

        income sex
Annina    2300   f
Petra     9600   f

Can you combine them into one dataset called ``income`` using the ``concat`` function?

In [63]:
income = pd.concat([income1, income2])
income

        income sex
Max       4300   m
Peter     8600   m
Mary      5200   f
Annina    2300   f
Petra     9600   f

You also have information on people's age:

In [64]:
age = pd.DataFrame({"age": [23, 34, 61, 19, 56]},
                    index=["Max", "Peter", "Mary", "Annina", "Petra"])

 Can you add it to your ``income`` data using ``concat``? And can you do the same using ``merge``? Which is usually preferable?

In [65]:
pd.concat([income, age], axis=1)

        income sex  age
Max       4300   m   23
Peter     8600   m   34
Mary      5200   f   61
Annina    2300   f   19
Petra     9600   f   56

In [66]:
income.merge(age, left_index=True, right_index=True)

        income sex  age
Max       4300   m   23
Peter     8600   m   34
Mary      5200   f   61
Annina    2300   f   19
Petra     9600   f   56

The merge strategy is a better fit, since we can merge two DataFrames even if the order of the indeces is different. For the concat we would end up with a faulty DataFrame, since the indeces would not match.

Now consider the following two datasets:

In [67]:
df1 = pd.DataFrame({"name":["Max", "Peter", "Mary" ],
                   "income": [4300, 8600, 5200],
                    "sex": ["m", "m", "f"]})
df1

    name  income sex
0    Max    4300   m
1  Peter    8600   m
2   Mary    5200   f

In [68]:
df2 = pd.DataFrame({"name": ["Max", "Peter", "Annina", "Petra"],
                    "age": [23, 34, 19, 56]})
df2

     name  age
0     Max   23
1   Peter   34
2  Annina   19
3   Petra   56

Perform (1) an ``inner``, (2) and ``outer`` and (3) a ``left`` merge and print the resulting dataframes. What observations are kept in each case?

In [69]:
# Inner merge
df1.merge(df2, how="inner", on="name")

    name  income sex  age
0    Max    4300   m   23
1  Peter    8600   m   34

In [70]:
# Outer merge
df1.merge(df2, how="outer", on="name")

     name  income  sex   age
0  Annina     NaN  NaN  19.0
1    Mary  5200.0    f   NaN
2     Max  4300.0    m  23.0
3   Peter  8600.0    m  34.0
4   Petra     NaN  NaN  56.0

In [71]:
# Left merge
df1.merge(df2, how="left", on="name")

    name  income sex   age
0    Max    4300   m  23.0
1  Peter    8600   m  34.0
2   Mary    5200   f   NaN

## Exercise 2

Consider the following dataset:

In [72]:
df_long = pd.DataFrame({"first_name": ["Max", "Max", "Annina", "Annina", "Annina"],
                        "year": [2021, 2022, 2020, 2021, 2022],
                        "salary": [4200, 4300, 0, 5700, 5800],
                        "occupation": ["phd student", "phd student", "student", "banker", "banker"]})
df_long

  first_name  year  salary   occupation
0        Max  2021    4200  phd student
1        Max  2022    4300  phd student
2     Annina  2020       0      student
3     Annina  2021    5700       banker
4     Annina  2022    5800       banker

Can you reshape it to a *wide* data format? Assign your new dataset to the variable ``df_wide``.

In [73]:
df_wide = pd.pivot(df_long,
                   index="first_name",
                   columns="year",
                   values=["salary", "occupation"])
df_wide

           salary             occupation
year         2020  2021  2022       2020         2021         2022
first_name
Annina          0  5700  5800    student       banker       banker
Max           NaN  4200  4300        NaN  phd student  phd student

Print out the column names of your new dataset.

In [74]:
df_wide.columns

MultiIndex([(    'salary', 2020),
            (    'salary', 2021),
            (    'salary', 2022),
            ('occupation', 2020),
            ('occupation', 2021),
            ('occupation', 2022)],
           names=[None, 'year'])

You should get a MultiIndex object (https://pandas.pydata.org/docs/user_guide/advanced.html). Can you find out how to print out Anninas salary in 2022 using this MultiIndex?

In [75]:
df_wide.loc["Annina", ("salary", 2022)]

5800

You don't like the MultiIndex and would like to have the following column names:
'name',
 'salary2020',
 'salary2021',
 'salary2022',
 'occupation2020',
 'occupation2021',
 'occupation2022'. Try to achieve this (e.g. by using a list comprehension).

In [76]:

df_wide.columns = [''.join((str(i[0]), str(i[1]))) for i in df_wide.columns]
df_wide

,salary2020,salary2021,salary2022,occupation2020,occupation2021,occupation2022
first_name,,,,,,
Annina,0,5700,5800,student,banker,banker
Max,NaN,4200,4300,NaN,phd student,phd student

Now look at the (row) index of your dataframe:

In [77]:
df_wide.index

Index(['Annina', 'Max'], dtype='object', name='first_name')

You will see that this index has a name (first_name), which is why ``first_name`` appears above "Annina" when your print out the data. You can also access it by typing ``df_wide.index.name``. Can you find a way to rename the index to ``name``?

In [79]:
df_wide.index.name = 'name'
df_wide

,salary2020,salary2021,salary2022,occupation2020,occupation2021,occupation2022
name,,,,,,
Annina,0,5700,5800,student,banker,banker
Max,NaN,4200,4300,NaN,phd student,phd student

Check out the documentation of the ``wide_to_long`` function (which is similar to ``melt``): https://pandas.pydata.org/docs/reference/api/pandas.wide_to_long.html. Can you use it to convert your data back to *long* format?

In [81]:
df_long_again = pd.wide_to_long(df_wide.reset_index(), ["salary", "occupation"], "name", "year")
df_long_again

            salary   occupation
name   year
Annina 2020      0      student
Max    2020    NaN          NaN
Annina 2021   5700       banker
Max    2021   4200  phd student
Annina 2022   5800       banker
Max    2022   4300  phd student

## Exercise 3

Read in the homicide data.

In [85]:

homicide = pd.read_csv("homicide.csv")
homicide

,country,code,gni_per_capita,population,continent,top10_share,homicide
0,Aruba,ABW,26250.0,104000.0,North America,NaN,NaN
1,Afghanistan,AFG,600.0,34414000.0,Asia,NaN,1.546670
2,Angola,AGO,4520.0,27884000.0,Africa,NaN,0.483067
3,Albania,ALB,4390.0,2891000.0,Europe,22.9,0.316194
4,Andorra,AND,NaN,78000.0,Europe,NaN,0.100418
...,...,...,...,...,...,...,...
197,Vanuatu,VUT,2910.0,271000.0,Oceania,29.1,0.213722
198,Samoa,WSM,3960.0,194000.0,Oceania,NaN,0.565338
199,South Africa,ZAF,6050.0,55386000.0,Africa,51.3,3.304199
200,Zambia,ZMB,1580.0,15879000.0,Africa,44.4,0.839167
201,Zimbabwe,ZWE,1280.0,13815000.0,Africa,33.8,1.002734

You would like to analyze homicide patterns across the globe. As a first step, you would like to know if homicide rates differ between continents. Use ``groupby`` to create an aggregated dataset called ``homicide_continents`` with the the homicide rate of the average country as well as the number of countries on each continent. It should look as follows:


|continent|mean| 	count|
| :- | -: | :-: |	
|Africa |	0.888916 |	50|
|Asia |	0.603732 |	43|
|Europe| 	0.218499| 	41|
|North America |	2.922844| 	25|
|Oceania |	0.568807 |	13|
|South America |	2.172048| 	11|

In [86]:
homicide_continents = homicide.groupby("continent")["homicide"].agg(["mean", "count"])
homicide_continents

                   mean  count
continent
Africa         0.888916     50
Asia           0.603732     43
Europe         0.218499     41
North America  2.922844     25
Oceania        0.568807     13
South America  2.172048     11

## Exercise 4

Now, you would like to find out if there is a correlation between homicide rates and life satisfaction. Import the the dataset "life_satisfaction_clean.csv" and merge it with your homicide data (keeping only the life statisfaction column). Make sure no observations in your homicide data are dropped.

In [92]:
satisfaction = pd.read_csv("life_satisfaction_clean.csv")
satisfaction

,country,code,gni_per_capita,life_satisfaction,population,continent,workhours,income_level
0,Afghanistan,AFG,600.0,2.694303,34414000.0,Asia,NaN,Low income
1,Albania,ALB,4390.0,5.004403,2891000.0,Europe,NaN,Upper middle income
2,Algeria,DZA,4850.0,5.043086,39728000.0,Africa,NaN,Upper middle income
3,Argentina,ARG,12570.0,5.792797,43075000.0,South America,1691.5363,High income
4,Armenia,ARM,4010.0,5.062449,2926000.0,Asia,NaN,Lower middle income
...,...,...,...,...,...,...,...,...
121,Uzbekistan,UZB,2600.0,6.205460,30930000.0,Asia,NaN,Lower middle income
122,Vietnam,VNM,1970.0,5.295547,92677000.0,Asia,2169.5916,Lower middle income
123,West Bank and Gaza,PSE,3670.0,4.553922,4529000.0,Asia,NaN,Lower middle income
124,Zambia,ZMB,1580.0,4.041488,15879000.0,Africa,NaN,Lower middle income
125,Zimbabwe,ZWE,1280.0,3.616480,13815000.0,Africa,NaN,Lower middle income

In [91]:
df = homicide.merge(satisfaction[["code", "life_satisfaction"]], on="code", how="left")
df

,country,code,gni_per_capita,population,continent,top10_share,homicide,life_satisfaction
0,Aruba,ABW,26250.0,104000.0,North America,NaN,NaN,NaN
1,Afghanistan,AFG,600.0,34414000.0,Asia,NaN,1.546670,2.694303
2,Angola,AGO,4520.0,27884000.0,Africa,NaN,0.483067,NaN
3,Albania,ALB,4390.0,2891000.0,Europe,22.9,0.316194,5.004403
4,Andorra,AND,NaN,78000.0,Europe,NaN,0.100418,NaN
...,...,...,...,...,...,...,...,...
197,Vanuatu,VUT,2910.0,271000.0,Oceania,29.1,0.213722,NaN
198,Samoa,WSM,3960.0,194000.0,Oceania,NaN,0.565338,NaN
199,South Africa,ZAF,6050.0,55386000.0,Africa,51.3,3.304199,4.883922
200,Zambia,ZMB,1580.0,15879000.0,Africa,44.4,0.839167,4.041488
201,Zimbabwe,ZWE,1280.0,13815000.0,Africa,33.8,1.002734,3.616480

Group your countries into 5 quantiles according to their life satisfaction and print out the mean, median, minimum and maximum homicide rate for each group.

In [93]:
df["quantile"] = pd.qcut(df["life_satisfaction"], 5, False)
df

,country,code,gni_per_capita,population,continent,top10_share,homicide,life_satisfaction,quantile
0,Aruba,ABW,26250.0,104000.0,North America,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,600.0,34414000.0,Asia,NaN,1.546670,2.694303,0.0
2,Angola,AGO,4520.0,27884000.0,Africa,NaN,0.483067,NaN,NaN
3,Albania,ALB,4390.0,2891000.0,Europe,22.9,0.316194,5.004403,1.0
4,Andorra,AND,NaN,78000.0,Europe,NaN,0.100418,NaN,NaN
...,...,...,...,...,...,...,...,...,...
197,Vanuatu,VUT,2910.0,271000.0,Oceania,29.1,0.213722,NaN,NaN
198,Samoa,WSM,3960.0,194000.0,Oceania,NaN,0.565338,NaN,NaN
199,South Africa,ZAF,6050.0,55386000.0,Africa,51.3,3.304199,4.883922,1.0
200,Zambia,ZMB,1580.0,15879000.0,Africa,44.4,0.839167,4.041488,0.0
201,Zimbabwe,ZWE,1280.0,13815000.0,Africa,33.8,1.002734,3.616480,0.0

In [95]:
df.groupby("quantile")["homicide"].agg(["mean", "median", "min", "max"])

              mean    median       min       max
quantile
0.0       0.845665  0.635328  0.076084  2.604220
1.0       0.700622  0.492465  0.101157  3.304199
2.0       0.795891  0.537163  0.052011  3.499262
3.0       1.709399  0.419169  0.079577  9.343013
4.0       0.753867  0.132571  0.058398  6.949676

## Exercise 5

Read in the file: ``real-gdp-per-capita.csv``. You will have to specifiy a few parameters to make sure this works properly. Try to read in the data in a way that requires only mimimal (or no) additional cleaning afterwards.

In [101]:
real_gdp_per_capita = pd.read_csv("real-gdp-per-capita.csv")
real_gdp_per_capita

       country code  year  gdp_per_capita
0      Albania  ALB  1970       2828.0728
1      Albania  ALB  1971       2869.7212
2      Albania  ALB  1972       2919.5935
3      Albania  ALB  1973       2968.1025
4      Albania  ALB  1974       3024.6765
...        ...  ...   ...             ...
9980  Zimbabwe  ZWE  2013       1881.8159
9981  Zimbabwe  ZWE  2014       1904.7742
9982  Zimbabwe  ZWE  2015       1847.6211
9983  Zimbabwe  ZWE  2016       1821.6588
9984  Zimbabwe  ZWE  2017       1871.8087

[9985 rows x 4 columns]

You would like to look at the GDP growth by continent. Merge your gdp data with the ``continent`` column from the dataset in the previous exercise. What kind of join did you perform?

In [102]:
real_gdp_per_capita = real_gdp_per_capita.merge(df[["code", "continent"]], "left", "code")
real_gdp_per_capita

       country code  year  gdp_per_capita continent
0      Albania  ALB  1970       2828.0728    Europe
1      Albania  ALB  1971       2869.7212    Europe
2      Albania  ALB  1972       2919.5935    Europe
3      Albania  ALB  1973       2968.1025    Europe
4      Albania  ALB  1974       3024.6765    Europe
...        ...  ...   ...             ...       ...
9980  Zimbabwe  ZWE  2013       1881.8159    Africa
9981  Zimbabwe  ZWE  2014       1904.7742    Africa
9982  Zimbabwe  ZWE  2015       1847.6211    Africa
9983  Zimbabwe  ZWE  2016       1821.6588    Africa
9984  Zimbabwe  ZWE  2017       1871.8087    Africa

[9985 rows x 5 columns]

Create a dataframe with the per-capita income growth (between 1950 and 2017) of the median country on each continent. The dataframe should have a row for each continent and a column with the respective growth rate. On which continent did the typical country fare best/worst?
<font color='violet'>
Hints: <font color='white'> You may need to group and reshape your data. If you keep only the years 1950 and 2017 before reshaping, your  dataset will be more compact.

In [ ]:
income_growth = real_gdp_per_capita[(real_gdp_per_capita["year"] == 2017) | (real_gdp_per_capita["year"] == 1950)]
income_growth

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().